wosayttn/M55M1BSP/_CUnit/spi/spi_cunit_org.c
/*----------------------------------------------------------------------------*/
/*                                                                            */
/* Copyright (C) 2016 Nuvoton Technology Corp. All rights reserved.           */
/*                                                                            */
/*----------------------------------------------------------------------------*/
/* File Contents:                                                                                          */
/*   spi_i2s_cunit.c                                                                                       */
/*            The test function of SPI/I2S for CUnit.                                                      */
/* Project:   M251                                                                                         */
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/* Includes of system headers                                                 */
/*----------------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <assert.h>

#include "NuMicro.h"
/*----------------------------------------------------------------------------*/
/* Includes of local headers                                                  */
/*----------------------------------------------------------------------------*/
#include "CUnit.h"
#include "Console.h"
#include "spi_cunit.h"
#include "spi_common.h"
#include "PinConfig.h"

//------------------------------------------------------------------------------
//extern unsigned int STATE0;
//extern unsigned int STATE1;
//extern unsigned int ERR_STATE0;
//extern unsigned int ERR_STATE1;

/*----------------------------------------------------------------------------*/
/* Test define                                                                */
/*----------------------------------------------------------------------------*/
//#define EN_MULTI_SPI1                           (1)

#define SPI_MODULE_NUM                          (4)

#define SPI_TEST_NUM                            (1)
#define SPI_I2S_FIRSTNO                         (0) //0: SPI0, 1 SPI1

//#if (EN_MULTI_SPI1 != 1)
//    #define SPI_TEST_NUM                            (1)
//    #define SPI_I2S_FIRSTNO                         (0) //0: SPI0, 1 SPI1
//#else
//    #define SPI_TEST_NUM                            (2)
//    #define SPI_I2S_FIRSTNO                         (0) //0: SPI0, 1 SPI1
//#endif //EN_MULTI_SPI1

//------------------------------------------------------------------------------
static SPI_T *g_apSPIModule[] =
{
    SPI0,
    SPI1,
    SPI2,
    SPI3,
};

static uint32_t gu32SPIModuleIdx = 0;

//------------------------------------------------------------------------------
void SetSPIModuleIdx(uint32_t u32SetValue)
{
    gu32SPIModuleIdx = u32SetValue;
}

uint32_t GetSPIModuleIdx(void)
{
    return gu32SPIModuleIdx;
}

void *GetSPIxModule(uint32_t u32SetValue)
{
    return g_apSPIModule[u32SetValue];
}

int SPI_I2S_Tests_Init(void)
{
    SPI_CLK_Sel(C_SPI0, eSPI_CLK_HIRC48M);
    SPI_CLK_Sel(C_SPI1, eSPI_CLK_HIRC48M);
    SPI_CLK_Sel(C_SPI2, eSPI_CLK_HIRC48M);
    SPI_CLK_Sel(C_SPI3, eSPI_CLK_HIRC48M);

    return 0;
}

void SPIxModuleInitPIN(uint32_t u32Module)
{
    switch (u32Module)
    {
        case C_SPI0:
            /* Slave selection signal active        /
               inactive                             /
               slave-under-run                      /
               bit-count-error                      /
               slave-underflow interrupt flag test */

            /* Set SPI_SS as output mode */
            SET_GPIO_PA3();
            GPIO_SetMode(PA, BIT3, GPIO_MODE_OUTPUT);
            /* Set SPI_CLK as GPIO output pin */
            SET_GPIO_PA2();
            GPIO_SetMode(PA, BIT2, GPIO_MODE_OUTPUT);
            /* Set SPI_CLK to low level */
            PA2 = 0;

            //SET_GPIO_PB7();
            //GPIO_SetMode(PB, BIT7, GPIO_MODE_OUTPUT);

            /* Set SPI_MOSI as GPIO output pin */
            SET_GPIO_PA0();
            GPIO_SetMode(PA, BIT0, GPIO_MODE_OUTPUT);
            break;

        case C_SPI1:
            /* Slave selection signal active/inactive/slave-under-run/bit-count-error/slave-underflow interrupt flag test */
            /* Set SPI_SS as output mode */
            SET_GPIO_PA6();
            GPIO_SetMode(PA, BIT6, GPIO_MODE_OUTPUT);
            /* Set SPI_CLK as GPIO output pin */
            SET_GPIO_PA7();
            GPIO_SetMode(PA, BIT7, GPIO_MODE_OUTPUT);
            /* Set SPI_CLK to low level */
            PA7 = 0;

            //SET_GPIO_PB7();
            //GPIO_SetMode(PB, BIT7, GPIO_MODE_OUTPUT);

            /* Set SPI_MOSI as GPIO output pin */
            SET_GPIO_PB4();
            GPIO_SetMode(PB, BIT4, GPIO_MODE_OUTPUT);
            break;

        case C_SPI2:
            /* Slave selection signal active/inactive/slave-under-run/bit-count-error/slave-underflow interrupt flag test */
            /* Set SPI_SS as output mode */
            SET_GPIO_PA11();
            GPIO_SetMode(PA, BIT11, GPIO_MODE_OUTPUT);
            /* Set SPI_CLK as GPIO output pin */
            SET_GPIO_PA10();
            GPIO_SetMode(PA, BIT10, GPIO_MODE_OUTPUT);
            /* Set SPI_CLK to low level */
            PA10 = 0;

            //SET_GPIO_PB7();
            //GPIO_SetMode(PB, BIT7, GPIO_MODE_OUTPUT);

            /* Set SPI_MOSI as GPIO output pin */
            SET_GPIO_PA8();
            GPIO_SetMode(PA, BIT8, GPIO_MODE_OUTPUT);
            break;

        case C_SPI3:
            /* Slave selection signal active/inactive/slave-under-run/bit-count-error/slave-underflow interrupt flag test */
            /* Set SPI_SS as output mode */
            SET_GPIO_PB10();
            GPIO_SetMode(PB, BIT10, GPIO_MODE_OUTPUT);
            /* Set SPI_CLK as GPIO output pin */
            SET_GPIO_PB11();
            GPIO_SetMode(PB, BIT11, GPIO_MODE_OUTPUT);
            /* Set SPI_CLK to low level */
            PB11 = 0;

            //SET_GPIO_PB7();
            //GPIO_SetMode(PB, BIT7, GPIO_MODE_OUTPUT);

            /* Set SPI_MOSI as GPIO output pin */
            SET_GPIO_PB8();
            GPIO_SetMode(PB, BIT8, GPIO_MODE_OUTPUT);
            break;
    }
}

void SPIxMISOWriteData(uint32_t u32Module, uint32_t data)
{
    switch (u32Module)
    {
        case C_SPI0:
            /* Set PA0 (SPI0_MOSI) to high level */
            PA0 = data;
            break;

        case C_SPI1:
            /* Set PB4 (SPI1_MOSI) to high level */
            PB4 = data;
            break;

        case C_SPI2:
            /* Set PA8 (SPI2_MOSI) to high level */
            PA8 = data;
            break;

        case C_SPI3:
            /* Set PB8 (SPI3_MOSI) to high level */
            PB8 = data;
            break;
    }
}

void SPIxClkLow(uint32_t u32Module)
{
    switch (u32Module)
    {
        case C_SPI0:
            /* Set PA2 (SPI0_CLK) to low level */
            PA2 = 0;
            break;

        case C_SPI1:
            /* Set PA7 (SPI1_CLK) to low level */
            PA7 = 0;
            break;

        case C_SPI2:
            /* Set PA10 (SPI2_CLK) to low level */
            PA10 = 0;
            break;

        case C_SPI3:
            /* Set PB11 (SPI2_CLK) to low level */
            PB11 = 0;
            break;
    }
}

void SPIxClkHigh(uint32_t u32Module)
{
    switch (u32Module)
    {
        case C_SPI0:
            /* Set PA2 (SPI0_CLK) to high level */
            PA2 = 1;
            break;

        case C_SPI1:
            /* Set PA7 (SPI1_CLK) to high level */
            PA7 = 1;
            break;

        case C_SPI2:
            /* Set PA10 (SPI2_CLK) to high level */
            PA10 = 1;
            break;

        case C_SPI3:
            /* Set PB11 (SPI2_CLK) to high level */
            PB11 = 1;
            break;
    }
}

void SPIxCSSLow(uint32_t u32Module)
{
    switch (u32Module)
    {
        case C_SPI0:
            /* Set PA3 (SPI0_SS) to low level */
            PA3 = 0;
            break;

        case C_SPI1:
            /* Set PA6 (SPI1_SS) to low level */
            PA6 = 0;
            break;

        case C_SPI2:
            /* Set PA11 (SPI2_SS) to low level */
            PA11 = 0;
            break;


        case C_SPI3:
            /* Set PB10 (SPI3_SS) to low level */
            PB10 = 0;
            break;
    }
}

