wosayttn/M55M1BSP/_CUnit/spi/spi_cunit_org.c
void SPIxCSSHigh(uint32_t u32Module)
{
    switch (u32Module)
    {
        case C_SPI0:
            /* Set PA3 (SPI0_SS) to high level */
            PA3 = 1;
            break;

        case C_SPI1:
            /* Set PA6 (SPI1_SS) to high level */
            PA6 = 1;
            break;

        case C_SPI2:
            /* Set PA11 (SPI2_SS) to high level */
            PA11 = 1;
            break;

        case C_SPI3:
            /* Set PB10 (SPI3_SS) to high level */
            PB10 = 1;
            break;
    }
}

int SPI_I2S_Tests_Clean(void)
{
    SPI_ClkDisable(C_SPI0);

    SPI_ClkDisable(C_SPI1);

    SPI_ClkDisable(C_SPI2);

    SPI_ClkDisable(C_SPI3);

    return 0;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: function_name                                                                                 */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               param - [in/out], parameter_description                                                   */
/*               param - [in/out], parameter_description                                                   */
/*                                                                                                         */
/* Returns:      the_value                                                                                 */
/* Side effects: the_effect                                                                                */
/* Description:                                                                                            */
/*               description                                                                               */
/*---------------------------------------------------------------------------------------------------------*/
void MACRO_SPI_CLR_UNIT_TRANS_INT_FLAG()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPIModule->CLKDIV = 4;
    SPIModule->CTL = 5;
    SPIModule->TX = 1;

    while ((SPIModule->STATUS & SPI_STATUS_UNITIF_Msk) == 0)
    {
        __NOP();
    }

    SPI_CLR_UNIT_TRANS_INT_FLAG(SPIModule);
    CU_ASSERT((SPIModule->STATUS & SPI_STATUS_UNITIF_Msk) == 0);

    /* Reset SPI */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_SPI_TRIGGER_DISABLE_RX_PDMA()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    CU_ASSERT((SPIModule->PDMACTL & SPI_PDMACTL_RXPDMAEN_Msk) == 0);
    SPI_TRIGGER_RX_PDMA(SPIModule);
    /* Check RXPDMAEN bit */
    CU_ASSERT((SPIModule->PDMACTL & SPI_PDMACTL_RXPDMAEN_Msk) == SPI_PDMACTL_RXPDMAEN_Msk);
    SPI_DISABLE_RX_PDMA(SPIModule);
    CU_ASSERT((SPIModule->PDMACTL & SPI_PDMACTL_RXPDMAEN_Msk) == 0);

    /* Reset SPI */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_SPI_TRIGGER_DISABLE_TX_PDMA()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    /* Check TXPDMAEN bit */
    CU_ASSERT((SPIModule->PDMACTL & SPI_PDMACTL_TXPDMAEN_Msk) == 0);
    SPI_TRIGGER_TX_PDMA(SPIModule);
    /* Check TXPDMAEN bit */
    CU_ASSERT((SPIModule->PDMACTL & SPI_PDMACTL_TXPDMAEN_Msk) == SPI_PDMACTL_TXPDMAEN_Msk);
    SPI_DISABLE_TX_PDMA(SPIModule);
    CU_ASSERT((SPIModule->PDMACTL & SPI_PDMACTL_TXPDMAEN_Msk) == 0);
    /* Reset SPI */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_SPI_GET_RX_FIFO_COUNT_EMPTY_FLAG()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPIModule->CLKDIV = 0xFF;
    /* Master mode, SPI mode 0. */
    SPIModule->CTL = 0x00000005;

    /* Check RX_EMPTY flag */
    CU_ASSERT(SPI_GET_RX_FIFO_EMPTY_FLAG(SPIModule) == 1);
    SPIModule->TX = 1;

    /* Check unit transfer interrupt flag */
    while ((SPIModule->STATUS & SPI_STATUS_UNITIF_Msk) == 0)
    {
        __NOP();
    }

    SPI_CLR_UNIT_TRANS_INT_FLAG(SPIModule);
    CU_ASSERT(SPI_GET_RX_FIFO_COUNT(SPIModule) == 1);

    /* Check RX_EMPTY flag */
    CU_ASSERT(SPI_GET_RX_FIFO_EMPTY_FLAG(SPIModule) == 0);

    SPIModule->TX = 2;

    while ((SPIModule->STATUS & SPI_STATUS_UNITIF_Msk) == 0)
    {
        __NOP();
    }

    SPI_CLR_UNIT_TRANS_INT_FLAG(SPIModule);
    CU_ASSERT(SPI_GET_RX_FIFO_COUNT(SPIModule) == 2);
    SPIModule->TX = 3;

    while ((SPIModule->STATUS & SPI_STATUS_UNITIF_Msk) == 0)
    {
        __NOP();
    }

    SPI_CLR_UNIT_TRANS_INT_FLAG(SPIModule);
    CU_ASSERT(SPI_GET_RX_FIFO_COUNT(SPIModule) == 3);
    SPIModule->TX = 4;

    while ((SPIModule->STATUS & SPI_STATUS_UNITIF_Msk) == 0)
    {
        __NOP();
    }

    SPI_CLR_UNIT_TRANS_INT_FLAG(SPIModule);
    CU_ASSERT(SPI_GET_RX_FIFO_COUNT(SPIModule) == 4);
    SPIModule->TX = 5;

    while ((SPIModule->STATUS & SPI_STATUS_UNITIF_Msk) == 0)
    {
        __NOP();
    }

    SPI_CLR_UNIT_TRANS_INT_FLAG(SPIModule);
    CU_ASSERT(SPI_GET_RX_FIFO_COUNT(SPIModule) == 4);
    SPIModule->TX = 6;

    while ((SPIModule->STATUS & SPI_STATUS_UNITIF_Msk) == 0)
    {
        __NOP();
    }

    SPI_CLR_UNIT_TRANS_INT_FLAG(SPIModule);
    CU_ASSERT(SPI_GET_RX_FIFO_COUNT(SPIModule) == 4);
    SPIModule->TX = 7;

    while ((SPIModule->STATUS & SPI_STATUS_UNITIF_Msk) == 0)
    {
        __NOP();
    }

    SPI_CLR_UNIT_TRANS_INT_FLAG(SPIModule);
    CU_ASSERT(SPI_GET_RX_FIFO_COUNT(SPIModule) == 4);
    SPIModule->TX = 8;

    while ((SPIModule->STATUS & SPI_STATUS_UNITIF_Msk) == 0)
    {
        __NOP();
    }

    SPI_CLR_UNIT_TRANS_INT_FLAG(SPIModule);
    CU_ASSERT(SPI_GET_RX_FIFO_COUNT(SPIModule) == 4);

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void MACRO_SPI_GET_TX_FIFO_EMPTY_FULL_FLAG()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPIModule->CLKDIV = 0xFF;
    /* Slave mode, SPI mode 0. */
    SPIModule->CTL = 0x00040005;
    /* Check TX_EMPTY flag */
    CU_ASSERT(SPI_GET_TX_FIFO_EMPTY_FLAG(SPIModule) == 1);
    /* Check TX_FULL flag */
    CU_ASSERT(SPI_GET_TX_FIFO_FULL_FLAG(SPIModule) == 0);
    SPIModule->TX = 1;
    /* Check TX_EMPTY flag */
    CU_ASSERT(SPI_GET_TX_FIFO_EMPTY_FLAG(SPIModule) == 0);
    /* Check TX_FULL flag */
    CU_ASSERT(SPI_GET_TX_FIFO_FULL_FLAG(SPIModule) == 0);
    SPIModule->TX = 2;
    SPIModule->TX = 3;
    SPIModule->TX = 4;
    SPIModule->TX = 5;
    SPIModule->TX = 6;
    SPIModule->TX = 7;
    SPIModule->TX = 8;
    /* Check TX_FULL flag */
    CU_ASSERT(SPI_GET_TX_FIFO_FULL_FLAG(SPIModule) == 1);

