wosayttn/M55M1BSP/_CUnit/spi/spi_cunit_org.c
void API_SPI_Close()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPIModule->CTL = 0x0000FFF4;
    SPI_Close(SPIModule);
    CU_ASSERT(SPIModule->CTL == 0x00000034);

    /* Reset SPI */
    ResetSPI(GetSPIModuleIdx());
}

void API_SPI_ClearRxFIFO()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPIModule->CLKDIV = 4;
    /* Master mode, SPI mode 0. */
    SPIModule->CTL = 0x00000005;
    /* Write 3 data to TX FIFO */
    SPIModule->TX = 1;
    SPIModule->TX = 2;
    SPIModule->TX = 3;

    /* Wait data transfer */
    while ((SPIModule->STATUS & SPI_STATUS_BUSY_Msk) != 0)
    {
        __NOP();
    }

    CU_ASSERT(SPI_GET_RX_FIFO_COUNT(SPIModule) == 3);
    SPI_ClearRxFIFO(SPIModule);
    CU_ASSERT(SPIModule->STATUS == 0x00059112);

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void API_SPI_ClearTxFIFO()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPIModule->CLKDIV = 0xFF;
    /* Slave mode, SPI mode 0. */
    SPIModule->CTL = 0x00040005;
    /* Write 3 data to TX FIFO */
    SPIModule->TX = 1;
    SPIModule->TX = 2;
    SPIModule->TX = 3;
    CU_ASSERT((SPIModule->STATUS & 0xF00F0000) == 0x30000000);   //CU_ASSERT((SPI0->STATUS & 0xF0000000)== 0x30000000);
    SPI_ClearTxFIFO(SPIModule);
    CU_ASSERT((SPIModule->STATUS & 0xF00F0000) == 0x00050000); //CU_ASSERT((SPI0->STATUS & 0xF0000000)== 0);

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void API_SPI_EnableAutoSS_DisableAutoSS()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPI_EnableAutoSS(SPIModule, SPI_SS, SPI_SS_ACTIVE_HIGH);
    CU_ASSERT(SPIModule->SSCTL == 0xD);
    SPI_DisableAutoSS(SPIModule);
    CU_ASSERT((SPIModule->SSCTL & (SPI_SSCTL_AUTOSS_Msk | SPI_SSCTL_SS_Msk)) == 0x0);
    SPI_EnableAutoSS(SPIModule, SPI_SS, SPI_SS_ACTIVE_LOW);
    CU_ASSERT(SPIModule->SSCTL == 0x9);
    SPI_DisableAutoSS(SPIModule);
    CU_ASSERT((SPIModule->SSCTL & (SPI_SSCTL_AUTOSS_Msk | SPI_SSCTL_SS_Msk)) == 0x0);

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void API_SPI_SetBusClock_GetBusClock()
{
    volatile uint32_t u32ReturnValue;
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    u32ReturnValue = SPI_SetBusClock(SPIModule, 200000);
    CU_ASSERT(SPIModule->CLKDIV == 0x00000EF);
    CU_ASSERT(u32ReturnValue == 200000);
    u32ReturnValue = SPI_GetBusClock(SPIModule);
    CU_ASSERT(u32ReturnValue == 200000);

    /* Reset SPI */
    ResetSPI(GetSPIModuleIdx());
}

void API_SPI_SetFIFO()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPI_SetFIFO(SPIModule, 1, 2);
    CU_ASSERT((SPIModule->FIFOCTL & 0xFF000000) == 0x12000000);
    SPI_SetFIFO(SPIModule, 0, 3);
    CU_ASSERT((SPIModule->FIFOCTL & 0xFF000000) == 0x03000000);
    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void API_SPI_EnableInt_DisableInt()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPI_EnableInt(SPIModule, SPI_UNIT_INT_MASK);
    CU_ASSERT_TRUE(SPIModule->CTL & 0x00020000);
    SPI_DisableInt(SPIModule, SPI_UNIT_INT_MASK);
    CU_ASSERT_FALSE(SPIModule->CTL & 0x00020000);

    SPI_EnableInt(SPIModule, SPI_SSACT_INT_MASK);
    CU_ASSERT_TRUE(SPIModule->SSCTL & 0x00001000);
    SPI_DisableInt(SPIModule, SPI_SSACT_INT_MASK);
    CU_ASSERT_FALSE(SPIModule->SSCTL & 0x00001000);

    SPI_EnableInt(SPIModule, SPI_SSINACT_INT_MASK);
    CU_ASSERT_TRUE(SPIModule->SSCTL & 0x00002000);
    SPI_DisableInt(SPIModule, SPI_SSINACT_INT_MASK);
    CU_ASSERT_FALSE(SPIModule->SSCTL & 0x00002000);

    SPI_EnableInt(SPIModule, SPI_SLVUR_INT_MASK);
    CU_ASSERT_TRUE(SPIModule->SSCTL & 0x00000200);
    SPI_DisableInt(SPIModule, SPI_SLVUR_INT_MASK);
    CU_ASSERT_FALSE(SPIModule->SSCTL & 0x00000200);

    SPI_EnableInt(SPIModule, SPI_SLVBE_INT_MASK);
    CU_ASSERT_TRUE(SPIModule->SSCTL & 0x00000100);
    SPI_DisableInt(SPIModule, SPI_SLVBE_INT_MASK);
    CU_ASSERT_FALSE(SPIModule->SSCTL & 0x00000100);

    SPI_EnableInt(SPIModule, SPI_TXUF_INT_MASK);
    CU_ASSERT_TRUE(SPIModule->FIFOCTL & 0x00000080);
    SPI_DisableInt(SPIModule, SPI_TXUF_INT_MASK);
    CU_ASSERT_FALSE(SPIModule->FIFOCTL & 0x00000080);

    SPI_EnableInt(SPIModule, SPI_FIFO_TXTH_INT_MASK);
    CU_ASSERT_TRUE(SPIModule->FIFOCTL & 0x00000008);
    SPI_DisableInt(SPIModule, SPI_FIFO_TXTH_INT_MASK);
    CU_ASSERT_FALSE(SPIModule->FIFOCTL & 0x00000008);

    SPI_EnableInt(SPIModule, SPI_FIFO_RXTH_INT_MASK);
    CU_ASSERT_TRUE(SPIModule->FIFOCTL & 0x00000004);
    SPI_DisableInt(SPIModule, SPI_FIFO_RXTH_INT_MASK);
    CU_ASSERT_FALSE(SPIModule->FIFOCTL & 0x00000004);

    SPI_EnableInt(SPIModule, SPI_FIFO_RXOV_INT_MASK);
    CU_ASSERT_TRUE(SPIModule->FIFOCTL & 0x00000020);
    SPI_DisableInt(SPIModule, SPI_FIFO_RXOV_INT_MASK);
    CU_ASSERT_FALSE(SPIModule->FIFOCTL & 0x00000020);

    SPI_EnableInt(SPIModule, SPI_FIFO_RXTO_INT_MASK);
    CU_ASSERT_TRUE(SPIModule->FIFOCTL & 0x00000010);
    SPI_DisableInt(SPIModule, SPI_FIFO_RXTO_INT_MASK);
    CU_ASSERT_FALSE(SPIModule->FIFOCTL & 0x00000010);

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void API_SPI_GetIntFlag_ClearIntFlag()
{
    volatile uint32_t u32DelayCount = 0;
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    /* Unit transfer interrupt flag test */
    SPIModule->CLKDIV = 4;
    /* Master mode, SPI mode 0. */
    SPIModule->CTL = 5;
    SPIModule->TX = 0;

    while ((SPIModule->STATUS & 0x0000002) == 0)
    {
        __NOP();
    }

    /* Check unit transfer interrupt flag */
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_UNIT_INT_MASK) == SPI_UNIT_INT_MASK);
    SPI_ClearIntFlag(SPIModule, SPI_UNIT_INT_MASK);
    CU_ASSERT(SPI_GetIntFlag(SPIModule, SPI_UNIT_INT_MASK) == 0);
    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
    __NOP();

    //SPIxModuleInitPIN(GetSPIModuleIdx());
    /* Set SPI_SS as output mode */
    SET_GPIO_PA3();
    GPIO_SetMode(PA, BIT3, GPIO_MODE_OUTPUT);
    /* Set SPI_CLK as GPIO output pin */
    SET_GPIO_PA2();
    GPIO_SetMode(PA, BIT2, GPIO_MODE_OUTPUT);
    /* Set SPI_CLK to low level */
    PA2 = 0;

    /* Enable self-test function */
    //outp32(0x40000014, 0x1);
    SYS->ALTCTL0 |= SYS_ALTCTL0_SELFTEST_Msk;

    /* Set (SPIx_SS) to high level */
    SPIxCSSHigh(GetSPIModuleIdx());

