wosayttn/M55M1BSP/_CUnit/spi/spi_cunit_org.c
    CU_ASSERT(SPII2S_GET_RX_FIFO_LEVEL(SPIModule) == 3);

    while ((SPIModule->I2SSTS & 0x0F000000) != 0x04000000)
    {
        __NOP();
    }

    CU_ASSERT(SPII2S_GET_RX_FIFO_LEVEL(SPIModule) == 4);

    /* Disable I2S RX function */
    SPIModule->I2SCTL = 0;

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void API_I2S_Open()
{
    uint32_t u32ReturnValue;
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());;

    SPI_CLK_Sel(GetSPIModuleIdx(), eSPI_CLK_HIRC48M);
    u32ReturnValue = SPII2S_Open(SPIModule, SPII2S_MODE_MASTER, 16000, SPII2S_DATABIT_24, SPII2S_MONO, SPII2S_FORMAT_PCMA);
    CU_ASSERT(SPIModule->I2SCTL == 0x20000067);
    CU_ASSERT(SPIModule->FIFOCTL == 0x21000000);
    CU_ASSERT(SPIModule->I2SCLK == 0x00001E00);
    CU_ASSERT(u32ReturnValue == 16129);

    ResetSPI(GetSPIModuleIdx());
    __NOP();

    u32ReturnValue = SPII2S_Open(SPIModule, SPII2S_MODE_SLAVE, 16000, SPII2S_DATABIT_32, SPII2S_STEREO, SPII2S_FORMAT_PCMB);
    CU_ASSERT(SPIModule->I2SCTL == 0x30000137);
    CU_ASSERT(SPIModule->FIFOCTL == 0x21000000);
    CU_ASSERT(SPIModule->I2SCLK == 0x00000000);
    CU_ASSERT(u32ReturnValue == 48000000);

    /* Reset SPI */
    ResetSPI(GetSPIModuleIdx());
}

void API_I2S_Close()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());
    SPIModule->I2SCTL = 1;
    SPII2S_Close(SPIModule);
    CU_ASSERT_FALSE(SPIModule->I2SCTL & 1);

    /* Reset SPI */
    ResetSPI(GetSPIModuleIdx());
}

void API_I2S_EnableInt_DisableInt()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPII2S_EnableInt(SPIModule, SPII2S_FIFO_TXTH_INT_MASK);
    CU_ASSERT((SPIModule->FIFOCTL & 0x8) == 0x8);
    SPII2S_DisableInt(SPIModule, SPII2S_FIFO_TXTH_INT_MASK);
    CU_ASSERT((SPIModule->FIFOCTL & 0x8) == 0);

    SPII2S_EnableInt(SPIModule, SPII2S_FIFO_RXTH_INT_MASK);
    CU_ASSERT((SPIModule->FIFOCTL & 0x4) == 0x4);
    SPII2S_DisableInt(SPIModule, SPII2S_FIFO_RXTH_INT_MASK);
    CU_ASSERT((SPIModule->FIFOCTL & 0x4) == 0);

    SPII2S_EnableInt(SPIModule, SPII2S_FIFO_RXOV_INT_MASK);
    CU_ASSERT((SPIModule->FIFOCTL & 0x20) == 0x20);
    SPII2S_DisableInt(SPIModule, SPII2S_FIFO_RXOV_INT_MASK);
    CU_ASSERT((SPIModule->FIFOCTL & 0x20) == 0);

    SPII2S_EnableInt(SPIModule, SPII2S_FIFO_RXTO_INT_MASK);
    CU_ASSERT((SPIModule->FIFOCTL & 0x10) == 0x10);
    SPII2S_DisableInt(SPIModule, SPII2S_FIFO_RXTO_INT_MASK);
    CU_ASSERT((SPIModule->FIFOCTL & 0x10) == 0);

    SPII2S_EnableInt(SPIModule, SPII2S_TXUF_INT_MASK);
    CU_ASSERT((SPIModule->FIFOCTL & 0x80) == 0x80);
    SPII2S_DisableInt(SPIModule, SPII2S_TXUF_INT_MASK);
    CU_ASSERT((SPIModule->FIFOCTL & 0x80) == 0);

    SPII2S_EnableInt(SPIModule, SPII2S_RIGHT_ZC_INT_MASK);
    CU_ASSERT(SPIModule->I2SCTL == 0x01000000);
    SPII2S_DisableInt(SPIModule, SPII2S_RIGHT_ZC_INT_MASK);
    CU_ASSERT(SPIModule->I2SCTL == 0);

    SPII2S_EnableInt(SPIModule, SPII2S_LEFT_ZC_INT_MASK);
    CU_ASSERT(SPIModule->I2SCTL == 0x02000000);
    SPII2S_DisableInt(SPIModule, SPII2S_LEFT_ZC_INT_MASK);
    CU_ASSERT(SPIModule->I2SCTL == 0);

    SPII2S_EnableInt(SPIModule, SPII2S_SLV_CLKERR_INT_MASK);
    CU_ASSERT(SPIModule->I2SCTL == 0x80000000);
    SPII2S_DisableInt(SPIModule, SPII2S_SLV_CLKERR_INT_MASK);
    CU_ASSERT(SPIModule->I2SCTL == 0);

    /* Reset SPIModule */
    ResetSPI(GetSPIModuleIdx());
}

void API_I2S_EnableMCLK()
{
    uint32_t u32ReturnValue;
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPI_CLK_Sel(GetSPIModuleIdx(), eSPI_CLK_HIRC48M);
    u32ReturnValue = SPII2S_EnableMCLK(SPIModule, 2048000);
    CU_ASSERT(SPIModule->I2SCTL == 0x00008000);
    CU_ASSERT(SPIModule->I2SCLK == 0x0000000B);
    CU_ASSERT(u32ReturnValue == 2181818);

    /* Reset SPI */
    ResetSPI(GetSPIModuleIdx());

    u32ReturnValue = SPII2S_EnableMCLK(SPIModule, 48000000);
    CU_ASSERT(SPIModule->I2SCTL == 0x00008000);
    CU_ASSERT(SPIModule->I2SCLK == 0x00000000);
    CU_ASSERT(u32ReturnValue == 48000000);

    /* Reset SPI */
    ResetSPI(GetSPIModuleIdx());
}

void API_I2S_DisableMCLK()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    /* Set MCLKEN bit to 1 */
    SPIModule->I2SCTL = 0x8000;
    SPII2S_DisableMCLK(SPIModule);

    /* Check MCLKEN bit */
    CU_ASSERT_FALSE(SPIModule->I2SCTL & 0x8000);

    /* Reset SPI */
    ResetSPI(GetSPIModuleIdx());
}

void API_I2S_SetFIFO()
{
    SPI_T *SPIModule = NULL;

    SPIModule = (SPI_T *)GetSPIxModule(GetSPIModuleIdx());

    SPII2S_SetFIFO(SPIModule, 0, 3);
    CU_ASSERT((SPIModule->FIFOCTL & 0xFF000000) == (SPII2S_FIFO_TX_LEVEL_WORD_0 | SPII2S_FIFO_RX_LEVEL_WORD_4));

    SPII2S_SetFIFO(SPIModule, 3, 0);
    CU_ASSERT((SPIModule->FIFOCTL & 0xFF000000) == (SPII2S_FIFO_TX_LEVEL_WORD_3 | SPII2S_FIFO_RX_LEVEL_WORD_1));

    SPII2S_SetFIFO(SPIModule, 2, 2);
    CU_ASSERT((SPIModule->FIFOCTL & 0xFF000000) == (SPII2S_FIFO_TX_LEVEL_WORD_2 | SPII2S_FIFO_RX_LEVEL_WORD_3));

    SPII2S_SetFIFO(SPIModule, 1, 1);
    CU_ASSERT((SPIModule->FIFOCTL & 0xFF000000) == (SPII2S_FIFO_TX_LEVEL_WORD_1 | SPII2S_FIFO_RX_LEVEL_WORD_2));

    /* Reset SPI1 */
    ResetSPI(GetSPIModuleIdx());
    __NOP();
}

CU_TestInfo SPI_I2S_MacroTests[] =
{
    /*
        Note:
        1. Palladimu use prload test
        2. MISO/MOSI connect.
    */
    {"Clear SPI unit transfer interrupt flag", MACRO_SPI_CLR_UNIT_TRANS_INT_FLAG},
    {"Trigger/Disable SPI RX DMA transfer", MACRO_SPI_TRIGGER_DISABLE_RX_PDMA},
    {"Trigger/Disable SPI TX DMA transfer", MACRO_SPI_TRIGGER_DISABLE_TX_PDMA},
    {"Get SPI RX FIFO count and empty flag", MACRO_SPI_GET_RX_FIFO_COUNT_EMPTY_FLAG},
    {"Get SPI TX FIFO empty and full flag", MACRO_SPI_GET_TX_FIFO_EMPTY_FULL_FLAG},
    {"Read SPI RX", MACRO_SPI_READ_RX},
    {"Write SPI TX", MACRO_SPI_WRITE_TX},
    {"Set SPI SS pin to high state", MACRO_SPI_SET_SS_HIGH},
    {"Set SPI SS pin to low state", MACRO_SPI_SET_SS_LOW},
    {"Enable/Disable SPI Byte Reorder function", MACRO_SPI_ENABLE_DISABLE_BYTE_REORDER},
    {"Set SPI suspend cycle", MACRO_SPI_SET_SUSPEND_CYCLE},
    {"Set SPI transfer sequence with LSB/MSB first", MACRO_SPI_SET_LSB_MSB_FIRST},
    {"Set SPI data width", MACRO_SPI_SET_DATA_WIDTH},
    {"Get SPI busy flag", MACRO_SPI_IS_BUSY},
    {"Enable/Disable SPI", MACRO_SPI_ENABLE_DISABLE},

